app/controllers/artwork_collections_controller.rb

    def create
        artwork_collection = ArtworkCollection.new(artwork_col_params)
        if artwork_collection.save
---
INSERT INTO "artwork_collections" ("collection_id", "artwork_id") VALUES ($1, $2) RETURNING "id"  [["collection_id", 2], ["artwork_id", 1]]

    def destroy
        artwork_collection = ArtworkCollection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]