app/controllers/artworks_controller.rb

    def index
        # debugger
        # artworks = Artwork.all
        if params.has_key?(:user_id)
            artworks = Artwork.where(artist_id: params[:user_id])
            artwork_shares = User.find(params[:user_id]).shared_artworks
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Park Slope"], ["image_url", "park.com"], ["artist_id", 1], ["created_at", "2020-01-02 14:29:03.965230"], ["updated_at", "2020-01-02 14:29:03.965230"]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "FUNNY NOSE"], ["updated_at", "2019-12-31 22:02:47.768565"], ["id", 7]]

    def favorite
        artwork = Artwork.find(params[:id])
        artwork.favorite = true
        artwork.save!
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2020-01-02 20:05:39.633194"], ["id", 1]]

    def unfavorite
        artwork = Artwork.find(params[:id])
        artwork.favorite = false
        artwork.save!
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2020-01-02 20:43:31.516711"], ["id", 1]]