app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 7], ["viewer_id", 1], ["created_at", "2019-12-31 22:29:56.592218"], ["updated_at", "2019-12-31 22:29:56.592218"]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_share_params)

        if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 8]]
---
    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2020-01-02 20:18:13.371174"], ["id", 1]]
---
    def favorite
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.favorite = true
        if artwork_share.save