app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 1]]
---
    def index
        if params.has_key?(:user_id)
            collections = Collection.where(user_id: params[:user_id])

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_collections" ON "artworks"."id" = "artwork_collections"."artwork_id" WHERE "artwork_collections"."collection_id" = $1  [["collection_id", 2]]
---
    def show
        collection = Collection.find(params[:id])
        artworks = collection.artworks
        render json: artworks.to_a.map{|ele| "#{ele.title} - #{ele.image_url}"}.unshift(collection.name)

INSERT INTO "collections" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "The Met"], ["user_id", 1], ["created_at", "2020-01-02 21:58:37.225627"], ["updated_at", "2020-01-02 21:58:37.225627"]]
---
    def create
        collection = Collection.new(collect_params)
        if collection.save

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 1]]
---
    def destroy
        collection = Collection.find(params[:id])
        collection.destroy