app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
    def index
        if params.has_key?(:user_id)
            comments = Comment.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: params[:artwork_id])

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Looks great!"], ["user_id", 3], ["artwork_id", 1], ["created_at", "2020-01-02 15:13:46.936069"], ["updated_at", "2020-01-02 15:13:46.936069"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save