app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 2]]
SELECT "likes".* FROM "likes" WHERE "likes"."likable_id" = $1 AND "likes"."likable_type" = $2  [["likable_id", 2], ["likable_type", "Artwork"]]
---
    def index
        # debugger
        if params.has_key?(:user_id)
            likes = Like.where(user_id: params[:user_id])
        elsif params.has_key?(:artwork_id)
            likes = Like.where(likable_id: params[:artwork_id], likable_type: "Artwork")
        elsif params.has_key?(:comment_id)
            likes = Like.where(likable_id: params[:comment_id], likable_type: "Comment")

INSERT INTO "likes" ("user_id", "likable_type", "likable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likable_type", "Artwork"], ["likable_id", 2], ["created_at", "2020-01-02 17:00:28.444744"], ["updated_at", "2020-01-02 17:00:28.444744"]]
---
    def create
        like = Like.new(like_params)

        if like.save