app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jonathan"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        # if params.has_key?("username")
        #     users = User.find_by username: params[:username]

        if params[:query]
            users = User.where('username LIKE ?', "%#{params[:query]}%")
        else
            users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Picasso"], ["created_at", "2019-12-31 21:07:40.628812"], ["updated_at", "2019-12-31 21:07:40.628812"]]
---
    def create
        user = User.new(user_params)
        if user.save

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Neev Granite"], ["updated_at", "2019-12-31 21:47:50.727795"], ["id", 2]]
---
    def update
        user = user_find

        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        user = user_find
        user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user_find
        User.find(params[:id])